//模拟后台传数据
var newsdata1 = [
  {
    "newsid": 0, //这是每条数据的索引  
    "toubutupian": "https://ss2.bdstatic.com/70cFvnSh_Q1YnxGkpoWK1HF6hhy/it/u=2944528064,1277871402&fm=26&gp=0.jpg",
    "name": "林间有风",
    "time": "2019/5/20",
    "title": "观雨有感",
    "smallarticl": "有时，外面下着雨心却晴着；又有时，外面晴着心却下着雨。世界上许多东西在对比中让你品味。心晴的时候，雨也是晴；心雨的时候，晴也是雨。不过，无论怎么样的故事，一逢上下雨便难忘。雨有一种神奇；它能弥漫成一种情调，浸润......",
    "centertupain": "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1558200621165&di=3cd259d55de9974d055b3d1a700dd6ee&imgtype=0&src=http%3A%2F%2Fgss0.baidu.com%2F94o3dSag_xI4khGko9WTAnF6hhy%2Fzhidao%2Fpic%2Fitem%2Fb21bb051f8198618960bb3a249ed2e738bd4e64c.jpg",
    "articl": "有时，外面下着雨心却晴着；又有时，外面晴着心却下着雨。世界上许多东西在对比中让你品味。心晴的时候，雨也是晴；心雨的时候，晴也是雨。不过，无论怎么样的故事，一逢上下雨便难忘。雨有一种神奇；它能弥漫成一种情调，浸润成一种氛围，镌刻成一种记忆。当然，有时也能瓢泼成一种灾难。 春天的风沙，夏天的溽闷，秋天的干燥，都使人们祈盼着下雨。一场雨还能使空气清新许多，街道明亮许多，“春雨贵如油”，对雨的渴盼不独农人有。有雨的时候既没有太阳也没有月亮，人们却多不以为然。或许因为有雨的季节气候不太冷，让太阳一边凉快会儿也好。有雨的夜晚则另有一番月夜所没有韵味。有时不由让人想起李商隐：“何当共剪西窗烛，却话巴山夜雨时”的名句。",
    "pinglunshuliang": "32",
    "shouchangliang": "15",
    "music": {
      "url": "https://api.mlwei.com/music/api/wy/?key=523077333&cache=0&type=url&id=1349292048",
      "title": "心如止水",
      "img":"https://api.mlwei.com/music/api/wy/?key=523077333&cache=0&type=pic&id=1349292048"

    },
  },
  
  
  {
    "newsid": 1, //这是每条数据的索引  
    "toubutupian": "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1555130389453&di=282c86ed16ab9da1b38265673db561bb&imgtype=0&src=http%3A%2F%2Fimg.duoziwang.com%2F2016%2F12%2F08%2F16432511570.jpg",
    "name": "喵星人",
    "time": "2019/4/21",
    "title": "本喵无敌",
    "smallarticl": "小花猫的脑袋圆圆的，顶着一对尖尖的小耳朵，那大大的绿眼睛瞪得像两盏小绿灯。小猫“咪咪”的那一双大耳朵，一天到晚都直竖着，哪个地方有声音，马上往那边转，活像一架有特殊性能的雷达。 这只花猫的全身是白底黑斑，远看上去，像一团雪白的棉花点上了几滴墨汁......",
    "centertupain": "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1555131320796&di=0e9540787e801b436c6043b95913d312&imgtype=0&src=http%3A%2F%2Fimg5.duitang.com%2Fuploads%2Fitem%2F201501%2F12%2F20150112210011_ZfS4C.png",
    "articl": "小花猫的脑袋圆圆的，顶着一对尖尖的小耳朵，那大大的绿眼睛瞪得像两盏小绿灯。小猫“咪咪”的那一双大耳朵，一天到晚都直竖着，哪个地方有声音，马上往那边转，活像一架有特殊性能的雷达。 这只花猫的全身是白底黑斑，远看上去，像一团雪白的棉花点上了几滴墨汁。 小猫鼻子下面有一张人字形的嘴巴，两旁有6根白色的胡须，常常一扇一扇的，挺神气。猫的胡子非常硬，像钢针一样，能量出洞口的尺寸。 小黑猫长长的尾巴像小鞭子似的，左右摇摆。 小猫有一对透亮灵活的大眼睛，黑黑的瞳仁还会变：早晨，像枣核；中午，就成了细线；夜里，却变成两只绿灯泡，圆溜溜的，闪闪发光。 小花猫早上起来先伸一下懒腰，然后再坐起来，用两只前爪在舌尖上舔一点唾沫，像人一样地洗着脸，再用舌头不停地舔着自己的毛皮，直到有一点光亮为止。",
    "pinglunshuliang": "18",
    "shouchangliang": "52",
    "music": {
      "url": "https://api.mlwei.com/music/api/wy/?key=523077333&cache=0&type=url&id=579954",
      "title": "恋爱循环",
      "img":"https://api.mlwei.com/music/api/wy/?key=523077333&cache=0&type=pic&id=579954"

    },
  },
  {

    "newsid": 2, //这是每条数据的索引  
    "toubutupian": "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1558196642421&di=69b77b077005198aa2328b8c6d7da3ea&imgtype=0&src=http%3A%2F%2Fimg.alicdn.com%2Ftfscom%2Fi2%2F743077453%2FTB2DHDTrwNlpuFjy0FfXXX3CpXa_%2521%2521743077453.jpg",
    "name": "浅蓝",
    "time": "2019/5/28",
    "title": "那一抹爱",
    "smallarticl": "迷茫的时候，疲倦的时候，纠结的时候，被人误会的时候，被批评的时候，你们是不是也一样需要一个肩膀需要一个怀抱？摔伤的时候饿肚子的时候打针输液的时候买衣服没人给建议的时候，你们是不是也一样需要一个眼神需要一份安慰？但是，你们坚守着。关于异地恋的日志因为......",
    "centertupain": "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1558197382413&di=adf524d64c07c06d6672c37ff77deeda&imgtype=0&src=http%3A%2F%2Fpic.51yuansu.com%2Fbackgd%2Fcover%2F00%2F42%2F54%2F5beea83302511.jpg%2521%2Ffw%2F780%2Fquality%2F90%2Funsharp%2Ftrue%2Fcompress%2Ftrue",
    "articl": "迷茫的时候，疲倦的时候，纠结的时候，被人误会的时候，被批评的时候，你们是不是也一样需要一个肩膀需要一个怀抱？摔伤的时候饿肚子的时候打针输液的时候买衣服没人给建议的时候，你们是不是也一样需要一个眼神需要一份安慰？但是，你们坚守着。关于异地恋的日志因为，你们的爱情比其他任何人的都纯粹，不掺杂什么不包含什么不顾虑什么，简简单单的，只是爱情，爱很轻，不惊扰彼此的世界，只在灵魂深处同行；爱很静，不妨碍彼此的生活，只在精神领域共鸣。爱情不能等失去了才去珍惜。如果有一天，我变得更冷漠了，请记得，我曾经要人陪的时候你也只说忙。最美丽的故事没有结局，最浪漫的感情没有归宿，最幸福的爱情没有言语，最深刻的喜欢没有空间。",
    "pinglunshuliang": "11",
    "shouchangliang": "52",
    "music": {
      "url": "https://api.mlwei.com/music/api/wy/?key=523077333&cache=0&type=url&id=1311319953",
      "title": "往后余生",
      "img": "https://api.mlwei.com/music/api/wy/?key=523077333&cache=0&type=pic&id=1311319953"
    },
  },
  {

    "newsid": 3, //这是每条数据的索引  
    "toubutupian": "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1560578972405&di=66050a3993e2cfe8056879778c487f92&imgtype=0&src=http%3A%2F%2Fp2.cri.cn%2FM00%2F05%2FA9%2FCqgRLlvqdiSAR75hAAAAAAAAAAA27.1417x797.jpeg",
    "name": "小茜",
    "time": "2019/5/25",
    "title": "月下初音",
    "smallarticl": "她，是仙境中的一个传说。可当她真正的站在叶罗丽战士或仙境的人的面前，却谁也不认识。她们只知道她很强大，惹不起！就连灵犀阁的众人也要忌惮她三分。她是善是恶，全看她本意和心情，谁也不能对她指三指四。而她的娃娃，也是一个强大的存在。两个人在一起，那是谁也无法超越的......",
    "centertupain": "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1560578770243&di=660e732351cd252b1e86f67af800fb06&imgtype=0&src=http%3A%2F%2Fuploads.5068.com%2Fallimg%2F1801%2F85-1P113091I4.jpg",
    "articl": "她，是仙境中的一个传说。可当她真正的站在叶罗丽战士或仙境的人的面前，却谁也不认识。她们只知道她很强大，惹不起！就连灵犀阁的众人也要忌惮她三分。她是善是恶，全看她本意和心情，谁也不能对她指三指四。而她的娃娃，也是一个强大的存在。两个人在一起，那是谁也无法超越的，简简单单的，只是爱情，爱很轻，不惊扰彼此的世界，只在灵魂深处同行；爱很静，不妨碍彼此的生活，只在精神领域共鸣。爱情不能等失去了才去珍惜。如果有一天，我变得更冷漠了，请记得，我曾经要人陪的时候你也只说忙。最美丽的故事没有结局，最浪漫的感情没有归宿，最幸福的爱情没有言语，最深刻的喜欢没有空间。",
    "pinglunshuliang": "14",
    "shouchangliang": "32",
    "music": {
      "url": "https://api.mlwei.com/music/api/wy/?key=523077333&cache=0&type=url&id=515453665",
      "title": "初梦",
      "img": "https://api.mlwei.com/music/api/wy/?key=523077333&cache=0&type=pic&id=515453665"
    },
  },
  {

    "newsid": 4, //这是每条数据的索引  
    "toubutupian": "http://pic1.win4000.com/wallpaper/5/56e3ae934d16b.jpg",
    "name": "绝世一击",
    "time": "2019/4/28",
    "title": "苍龙伏枪",
    "smallarticl": "有时候，我总是很弱，有时候我也很强。但却不知怎么合一。两个自已却在世界上忽出忽走，但总觉得自已还与真正的我同行，但却总有事出现，使我变得硬而变，这虽然不足气，但还想重折，但为众不能为已。世上有绿色通道，但却毫无意义......",
    "centertupain": "http://www.kele8.com/uploadfile/2014/0314/20140314012548496.jpg",
    "articl": "有时候，我总是很弱，有时候我也很强。但却不知怎么合一。两个自已却在世界上忽出忽走，但总觉得自已还与真正的我同行，但却总有事出现，使我变得硬而变，这虽然不足气，但还想重折，但为众不能为已。世上有绿色通道，但却毫无意义...这使我明白了强而弱中，需要冷力退步。而不是猛步。却只见日梦中你英勇猛步，而今却见你一退在退，猛步无罢，心中猛步差矣。需返它海天之梦，如它在一在犯我雄心，雄心猛步出步也罢; 此中定合一，不为！ 如我乃犯错，众全人能于谅我,你落得如此永恒来这世界， 与熙攘的众生一样清澈又疲惫。我们从一个梦里醒到另一个梦里，发现醒才是最深的魇寐。我们本是一颗颗冬蝉般的草木之心，却无意吞下一整个黑夜的火种， 当悬崖刺破天空，这不可一世的好阳光带来万物断裂的声音。若以爱之名有何不可在烈日灼光中英勇苟活！",
    "pinglunshuliang": "20",
    "shouchangliang": "42",
    "music": {
      "url": "https://api.mlwei.com/music/api/wy/?key=523077333&cache=0&type=url&id=31654455",
      "title": "Victory",
      "img": "https://api.mlwei.com/music/api/wy/?key=523077333&cache=0&type=pic&id=31654455"

    },
  },
 
  {
    "newsid": 5, //这是每条数据的索引
    "toubutupian": "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1555130116998&di=64e1e753dc9a39150c859ebd4518e6db&imgtype=0&src=http%3A%2F%2Fhbimg.b0.upaiyun.com%2F86bc6d5d28da5cfc5461effcc04b31ea281256e66f97-GHCT9Z_fw658",
    "name": "小天",
    "time": "2019/4/21",
    "title": "岁月不老，一生同在",
    "smallarticl": "菊花的样子千姿百态。有红的，有黄的，白的有紫的，有针形的，有丝形的，真是万紫千红。菊花的种类有很多，有白色的绣球菊，它的叶子又肥又大，身上雪白雪白的，远得看起来像一个大雪球，闻起来还有一股清香呢！金黄的绣球菊又像妈妈找毛衣用的线团，里面娇嫩可爱的蕊像害羞的小姑娘......",
    "centertupain": "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1555138309328&di=16db200701108ba6d753718f83ba9013&imgtype=0&src=http%3A%2F%2Fuploads.oh100.com%2Fallimg%2F1706%2F234Z45049-0.jpg",
    "articl": "菊花的样子千姿百态。有红的，有黄的，白的有紫的，有针形的，有丝形的，真是万紫千红。菊花的种类有很多，有白色的绣球菊，它的叶子又肥又大，身上雪白雪白的，远得看起来像一个大雪球，闻起来还有一股清香呢！金黄的绣球菊又像妈妈找毛衣用的线团，里面娇嫩可爱的蕊像害羞的小姑娘。十丈珠帘的花瓣很少，细细长长的，很像小姑娘的头发，又像老虎脚上尖尖的小爪子。菊花红的似火，黄的似金，白的似银，紫的似紫水晶……瞧，花儿有的含苞欲放，像一位纯洁的少女用细嫩的手捧着脸庞；有的已经完全绽开，向人们露出甜甜的笑脸。一朵杜鹃花伸进鸡蛋花丛中，好像两姐妹在小声地说着什么。菊花散发出淡淡清香，不时引来了一群群蜜蜂好像和蝴蝶。 我赞美菊花，因为秋天的菊花颜色绚丽多彩，十分美丽。它有似火的红色，如火如荼；有赛金的黄色，金光闪闪；有胜雪的白色，纯洁无比；有娇嫩的粉色，清淡高雅……在绿叶的衬托下，显得更加美丽，使人百看不厌。",
    "pinglunshuliang": "10",
    "shouchangliang": "30",
    "music": {
      "url": "https://api.mlwei.com/music/api/wy/?key=523077333&cache=0&type=url&id=1313558186",
      "title": "一曲相思",
      "img": "https://api.mlwei.com/music/api/wy/?key=523077333&cache=0&type=pic&id=1313558186"

    },

  },
  {
    "newsid": 6, //这是每条数据的索引
    "toubutupian": "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1560577481016&di=71a33cb4340b8c97befdfec17d4a2276&imgtype=0&src=http%3A%2F%2Fimg.pconline.com.cn%2Fimages%2Fupload%2Fupc%2Ftx%2Fitbbs%2F1905%2F20%2Fc5%2F148563605_1558316138604_mthumb.jpg",
    "name": "随影",
    "time": "2019/6/21",
    "title": "生活往事",
    "smallarticl": "一年四季，我喜欢坐在宿舍附近的公园草坪上。在有雨的日子，我坐在房间里，或者临窗而望这一片安谧的地方。或者一边捧着书，一边啜饮咖啡。或者什么都不做。寂廖的身影一个。在天气晴朗的日子，我依旧捧着一本书，对着柔和的阳光，静静的坐着，什么事情都不做，想着一些不着边际的问题。我就是在这个公园中，这块草坪上认识芸与强的......",
    "centertupain": "http://pic1.win4000.com/wallpaper/d/58465a6a35706.jpg",
    "articl": "一年四季，我喜欢坐在宿舍附近的公园草坪上。在有雨的日子，我坐在房间里，或者临窗而望这一片安谧的地方。或者一边捧着书，一边啜饮咖啡。或者什么都不做。寂廖的身影一个。在天气晴朗的日子，我依旧捧着一本书，对着柔和的阳光，静静的坐着，什么事情都不做，想着一些不着边际的问题。我就是在这个公园中，这块草坪上认识芸与强的。芸说你有一种如水的文静，很容易给女生那种安全感的男生。于是，强与芸在不同的时间，在相同的空间坐了下来。于是，在不下雨的日子里我的身影就不在孤单了。我和强，我与芸在一年四季不断的交替着情感。交流着……后来，强有了女友丽。强常带着丽陪我坐在公园的草坪上。草坪是孤寂的，自从丽的到来后便是盈盈笑声了。强与丽是生动的。他们的爱情，他们的生活。在我眼中他们是幸福的一对。强说你与芸何尝不是呢？芸，一个单纯可爱的女孩。我笑着摇了摇头，不能说我不为芸儿所感动。不能说我没有对芸儿动心过，与芸儿在阳光静谧的时候，甚至有一种想吻她的冲动。看着她，我的心里就有一种非常满足的幸福，但内心深处的声音却固执的告诉我，你不配拥有爱情，不要伤害她。这个世界没有亘久的爱情。在我过去的十年的岁月中。在我过去的人生中总习惯看着书来消磨时间，看的多了，接触得也多了。所以对人生也疑惑了起来。芸对我很好，我没有办法拒绝，只好默默的接受。芸总在我快睡下的时候打电话来，提醒我明天还要上班，还有天气转凉了，记得多加件衣服。不然很容易感冒的……。在忙碌的现代生活步伐中，芸总会抽出时间来陪我坐在公园的草坪上。尽管我平时很少说话，只是静静的坐着。芸说她喜欢上一个男人，一个文静的男人，他不喜欢说话。能够给人安全感的那种男人。他总喜欢坐在公园的草坪上，着一身浅蓝色的衣服。芸对我说的时候，我发现了她的头低着，脸上绽着点点红晕。对于这样的表白，我也深深的感动。我发现自己也喜欢像她这样的女孩。但我没有去爱的勇气。对芸一直以来都是淡淡的，从没有刻意的去做一些什么事。也没有恣情的去接受或拒绝。我知道芸的生活中一定有很多的追求者，有非常广阔的天空。她是开朗活泼的。与我坐在一起时的那一份闲静截然不同。我没有去问她。她也不对我说。草坪上，柔和的阳光。　丽的开朗大方全然不同于强的内敛芸的闲静我的懒散。从来就没有人要求情侣之间要遵守能量互补原则的。但如果有人遵守了，他们一定可以互相吸引，互相艳羡……。所以我喜欢看强与丽在柔和的阳光下恣情的游乐、嬉戏。我的目光是深邃的，看他们的嬉闹如大人骄纵小孩子般。对于二十二岁的我。强与芸就是我的整个生命。",
    "pinglunshuliang": "50",
    "shouchangliang": "20",
    "music": {
      "url": "https://api.mlwei.com/music/api/?key=523077333&type=url&id=003LhWQW2QMLYZ&size=",
      "title": "离开的借口",
      "img": "https://p3fx.kgimg.com/stdmusic/20190104/20190104181010786924.jpg"

    },

  },


  
]
//调出函数，将：后的函数赋值给newdata,这就叫数据模块化
module.exports = {
  newsdata2: newsdata1
}